# Pandas Introduction

Pandas is a data manipulation and analysis package for Python. Pandas is derived from 'Panal Data'. Built on top of NumPy

Pandas adds two more data structures into Python: Panda Series and Pandas DataFrame. They let you easily work with labeled and relational data.

[Pandas Documentation](https://pandas.pydata.org/pandas-docs/stable/)

Machine learning uses huge datasets but although it's good to have a large quantity of data, it also needs to be of good quality. Many datasets will often have missing values, outliers, incorrect values, etc. Having data with a lot of missing or bad values, for example, does not allow machine learning algorithms to perform well.

It's important to look at the data first and make sure it's okay to be used for your training algorithm. You can do this with some basic data analysis, which Pandas helps with!

Pandas Series and DataFrames are designed for fast data analysis and manipulation, as well as being flexible and easy to use. 

**Pandas features**:

- Allows the use of labels for rows and columns
- Can calculate rolling statistics on time series data
- Easy handling of NaN values
- Is able to load data of different formats into DataFrames
- Can join and merge different datasets together
- It integrates with NumPy and Matplotlib

Pandas DataFrames is one of the most commonly used Pandas objects for data analysis in Python.

### Installation
`conda install pandas`

In [1]:
# Import
import pandas as pd

## Pandas Series

Series is a 1-dim. array-like object that can hold many datatypes (unlike NumPy ndarrays which can only hold one type).

Series allow you to assign index labels to each element. You can name the indices anything you want!

Create with `pd.Series(data, index)` where `index` is a list of index labels.

In [2]:
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], 
                      index=['eggs', 'apples', 'milk', 'bread'])

groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Series are displayed with indices in the first column and data in the second.

## Series Attributes

In [3]:
# shape
groceries.shape

(4,)

In [4]:
# dimension
groceries.ndim

1

In [5]:
# size (number of elements)
groceries.size

4

In [6]:
# Get the data values
groceries.values

array([30, 6, 'Yes', 'No'], dtype=object)

In [7]:
print(groceries.values)

[30 6 'Yes' 'No']

In [8]:
# Get index
groceries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [9]:
# Check if a label exists
bananas = 'bananas' in groceries
print(bananas)

apples = 'apples' in groceries
print(apples)

False
True

## Accessing, Modifying and Deleting Elements in Series

You can access elements in many different ways:
- using index labels or numerical indices in brackets `[]`
- `.loc` lets us explicitly state you're using labeled index to access
- `.iloc` lets us explicitly state you're using integer location index to access

### Access

In [10]:
# access single index label
groceries['eggs']

30

In [11]:
# access single index with .loc
groceries.loc['eggs']

30

In [12]:
# access multiple index labels
groceries[['milk', 'bread']]

milk     Yes
bread     No
dtype: object

In [13]:
# access multiple index labels with .loc
groceries.loc[['milk', 'bread']]

milk     Yes
bread     No
dtype: object

In [14]:
# access single numerical index (can be negative too)
groceries[0]

30

In [15]:
# access single numerical index with .iloc
groceries.iloc[0]

30

In [16]:
# access multiple numerical index values
groceries[[0, -1]]

eggs     30
bread    No
dtype: object

In [17]:
# access multiple numerical index values with .iloc
groceries.iloc[[1, 2]]

apples      6
milk      Yes
dtype: object

### Modify

Pandas Series are also mutable like NumPy ndarrays

In [18]:
print(groceries)

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [19]:
# Change a value
groceries['eggs'] = 2
print(groceries)

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

### Delete

Use `.drop()` to delete an element. This does NOT modify the orginal unless given the `inplace = True` option as an arg.

In [20]:
print(groceries)

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [21]:
# remove apples without modifying (returns a new Series)
groceries.drop('apples')

eggs       2
milk     Yes
bread     No
dtype: object

In [22]:
print(groceries)

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [23]:
# remove and modify at the same time
groceries.drop('apples', inplace = True)
print(groceries)

eggs       2
milk     Yes
bread     No
dtype: object

## Arithmetic Operations on Pandas Series

Like NumPy ndarrays, you can do element-wise arithmetic operations on Series. This also works if the series has multiple datatypes, as long as the operation is possible for each datatype (e.g. strings will be repeated if multiplied by 2), if not, you will get an error.

### Operations with single numbers

Does NOT mutate the original

In [24]:
fruits = pd.Series(data = [10, 6, 3], index = ['apples', 'oranges', 'bananas'])

fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [25]:
# Adding to each element
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [26]:
# Subracting to each element
fruits - 2

apples     8
oranges    4
bananas    1
dtype: int64

In [27]:
# Multiplying each element
fruits * 3

apples     30
oranges    18
bananas     9
dtype: int64

In [28]:
# Dividing each element
fruits / 3

apples     3.333333
oranges    2.000000
bananas    1.000000
dtype: float64

### Using NumPy mathematical functions

Import numpy to use it's functions on Series

In [29]:
import numpy as np

In [30]:
# EXP
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [31]:
# Square root
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [32]:
# To power of
np.power(fruits, 2)

apples     100
oranges     36
bananas      9
dtype: int64

### Operations on specific elements

Does NOT change original

In [33]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [34]:
fruits['bananas'] + 2

5

In [35]:
fruits.iloc[-1] - 2 # bananas - 2

1

In [36]:
# multiple elements
fruits[['apples', 'oranges']] * 10

apples     100
oranges     60
dtype: int64

In [37]:
fruits.loc[['apples', 'bananas']] / 2

apples     5.0
bananas    1.5
dtype: float64

## Boolean Indexing

In [38]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [39]:
# Get fruits with count more than 4
fruits[fruits > 4]

apples     10
oranges     6
dtype: int64

In [40]:
# Get fruits with count less than 10 and more than 4
fruits[(fruits < 10) & (fruits > 4)]

oranges    6
dtype: int64

## Pandas DataFrames

DataFrames are a 2-dim. structure with labeled rows and columns that can hold many data types, similar to a spreadsheet.

Can be created manually or loaded from a file. You can create them manually with dictionaries of Panda Series.

### Creating with dictionaries

In [41]:
# Create a dictionary
items = {
    'Bob': pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
    'Alice': pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])
}

print(items)

{'Bob': bike     245
pants     25
watch     55
dtype: int64, 'Alice': book        40
glasses    110
bike       500
pants       45
dtype: int64}

In [42]:
# Create the DataFrame
shopping_carts = pd.DataFrame(items)

shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

DataFrames are displayed in table form. Row labels are built from the union of the index labels of the Pandas Series. The Column labels are taken from dictionary keys. `NaN` is given when the dataframe doesn't have a value for a particular row and column. (`NaN` values need to be removed before using in algorithms)

If there are no index label, rows will be use numerical row indices and labels:

In [43]:
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

df = pd.DataFrame(data)

df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

## DataFrame Attributes

In [44]:
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [45]:
# Shape (rows, columns)
shopping_carts.shape

(5, 2)

In [46]:
# Dimension
shopping_carts.ndim

2

In [47]:
# Total number of elements (rows  x columns)
shopping_carts.size

10

In [48]:
# Get values
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [49]:
# Get index (row labels)
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [50]:
# Columns (column labels)
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

### Creating DataFrames with Subsets of Data

You may only be interested in a subset of the data. Pandas lets you select which data hou want to put into the DataFrame with the keywords `columns` and `index`.

In [51]:
# Selecting columns (keys of the dictionary)
bob_shopping_cart = pd.DataFrame(items, columns = ['Bob'])

bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [52]:
# Selecting rows (using index labels from Series)
selected_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

selected_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [53]:
# Selecting a column and a row
alice_selected_shopping_cart = pd.DataFrame(items, columns = ["Alice"], 
                                            index = ["glasses", "bike"])

alice_selected_shopping_cart

         Alice
glasses    110
bike       500

### Creating DataFrames with Dictionaries of Lists

In this case, all lists must be of the same length. Rows will be labeled with numerical indices.

In [54]:
# Create data with dictionaries of lists
data = {"Integers": [1, 2, 3],
        "Floats": [4.5, 5.5, 9.9]}

df = pd.DataFrame(data)

df

   Integers  Floats
0         1     4.5
1         2     5.5
2         3     9.9

Indices can still be labeled with an index using the `index` keyword.

In [55]:
data = {"Integers": [1, 2, 3],
        "Floats": [4.5, 5.5, 9.9]}

df = pd.DataFrame(data, index = ['first', 'second', 'third'])

df

        Integers  Floats
first          1     4.5
second         2     5.5
third          3     9.9

### Creating DataFrames with a List of Dictionaries

In [56]:
# Create list of dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
         {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# Create DataFrame
store_items = pd.DataFrame(items2)

store_items

   bikes  pants  watches  glasses
0     20     30       35      NaN
1     15      5       10     50.0

Again, this won't label the rows and automatically uses numerical indices. Labels can be provided when creating.

In [57]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
         {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# Create DataFrame
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

## Accessing Elements in DataFrames

You can access rows, columns, or individual elements by using row and column labels.

In [58]:
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [59]:
# Access a certain column by label
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [60]:
# Access multiple columns by label
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [61]:
# Access a certain row by using .loc with label (need to use .loc)
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

Individual elements with `dataframe[column][row]`

In [62]:
# Access a certain value in row and column
# Labels for column must be given first or you get a KeyError!
store_items['bikes']['store 2']

15

### Modifying DataFrames

In [63]:
# Adding a columns to the end
store_items['shirts'] = [15, 2]

store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [64]:
# Add a column by using math operations between other columns
store_items['suits'] = store_items['shirts'] + store_items['pants']

store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

In [65]:
# Adding a new row
# Create a list with dictionary (like before)
store_3_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# Create the new store as a DataFrame
store_3 = pd.DataFrame(store_3_items, index = ['store 3'])

store_3

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [66]:
# Add the new store to the main DataFrame with append() 
# (does not modify original unless reassigned)
store_items = store_items.append(store_3)

store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

### Add new column with data from particular rows/columns

For example, suppose that you want to stock stores 2 and 3 with new watches and you want the quantity of the new watches to be the same as the watches already in stock for those stores.

In [67]:
# Data to add - watch count from store 2 and 3
new_watch_quantities = store_items['watches'][1:]

new_watch_quantities

store 2    10
store 3    35
Name: watches, dtype: int64

In [68]:
# Use this to populate a new column
store_items['new watches'] = new_watch_quantities

store_items

         bikes  pants  watches  glasses  shirts  suits  new watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

### Insert new columns to a specific position

Use `dataframe.insert(loc, label, data)` method. Adds column to given `dataframe` right before the `loc` with a `label` and given `data`. `loc` must be an integer.

In [69]:
# Add new column 'shoes' right before 'suits'
store_items.insert(4, 'shoes', [8, 5, 0])

store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new watches
store 1     20     30       35      NaN      8    15.0   45.0          NaN
store 2     15      5       10     50.0      5     2.0    7.0         10.0
store 3     20     30       35      4.0      0     NaN    NaN         35.0

### Deleting from DataFrames

To delete rows and columns, use `.pop()` and `.drop()`.
`.pop()` only lets us remove columns. `.drop()` can be used to remove both columns and rows using the `axis` keyword.

In [70]:
# Remove one column with pop
store_items.pop('new watches')

store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN      8    15.0   45.0
store 2     15      5       10     50.0      5     2.0    7.0
store 3     20     30       35      4.0      0     NaN    NaN

In [71]:
# Remove multiple columns with drop(columns, axis = 1)
# does not change original
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

In [72]:
# Remove rows with drop(rows, axis = 0)
store_items = store_items.drop(['store 1', 'store 2'], axis = 0)

store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

### Renaming column and row labels

Use the `.rename()` method

In [73]:
# change bikes to hats (does not change original)
store_items = store_items.rename(columns = {'bikes': 'hats'})

store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [74]:
# Change row name
store_items = store_items.rename(index = {'store 3': 'last store'})

store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

### Change index to be a column from the dataframe

Use the `.set_index()` method

In [75]:
store_items = store_items.set_index('pants')

store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

# Dealing with NaN in DataFrames

One common type of 'bad data' is missing values. When using Pandas, missing values are assigned as `NaN`.

Here are methods on how to clean the data

In [76]:
# Data with missing values
items3 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# Create a DataFrame
store_items = pd.DataFrame(items3, index = ['store 1', 'store 2', 'store 3'])

store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

## Detecting null values

One method is to combine `.isnull()` and `.sum()` methods.

`isnull()` returns a dataframe of the same size with `True` for elements that have `NaN` values and `False` for those that have values.

In [77]:
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In Pandas, logical `True` values have numerical value `1` and logical `False` values have numerical value `0`. You can count the number of `NaN` values by counting the number of `True` values with `sum()`.

Calling `sum()` after `isnull()` once will give you the number of `True` values (number of values that were null) for each column.

In [78]:
store_items.isnull().sum()

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

Calling `.sum()` again will give you the total number of `True` (number of values that were null)

In [79]:
store_items.isnull().sum().sum()

3

Another method is to count the number of non-NaN values using `.count()`. It will return the number celss with filled in values for each column.

Any column with a count less than the number of rows has a `NaN` value.

In [80]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

## Deleting or Replacing null values

We can deal with `NaN` by either deleting or replacing

### Eliminate rows or columns with NaN values

Use `.dropna(axis)` method to drop rows (`axix = 0`) or columns (`axis = 1`) with `NaN`. This does NOT modify the original. Use `.dropna(axis, inplace = True)` to do so inplace.

In [81]:
# Drop rows with NaN
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [82]:
# Drop columns with NaN
store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

### Replace NaN values

#### `.fillna()` method

You can, for example, replace `NaN` with `0` by using `.fillna()`. (Does NOT modify original)

In [83]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

You can also "forward fill" values by replacing `NaN` with values taken from the previous column or row.

`.fillna(method = 'ffill', axis)` will do this. `axis = 0` will use previous value from the same column. `axis = 1` will use the previous value from same row.

In [84]:
# replace NaN values with the previous value in the column
print(store_items)

store_items.fillna(method = 'ffill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

Notice that value in the first row didn't get replaced. That's because there is no previous value!

`.fillna(method = 'backfill', axis)` will use "backward filling". That is, value from the next cell will be used. `axis = 0` will use next value from the same column. `axis = 1` will use the next value from same row.

In [85]:
# replace NaN values with the next value in the column
print(store_items)

store_items.fillna(method = 'backfill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

Again, values in the last row did not get filled because there is no next value.

We can also use the row values instead.

In [86]:
# replace NaN values with the previous value in the row
print(store_items)

store_items.fillna(method = 'ffill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [87]:
# replace NaN values with the next value in the row
print(store_items)

store_items.fillna(method = 'backfill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

#### `.interpolate()` method

For example, the `.interpolate(method = 'linear', axis)` method will use linear interpolation to replace `NaN` values using the values along the given axis.

In [88]:
# use linear interpolation to replace NaN using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

Notice that the first `NaN` value in a column did not get interpolated because there is no data to use for the interpolation function at that point.

In [89]:
# use linear interpolation to replace NaN using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

# Loading Data into a Pandas DataFrame

You'll usually use databases and CSV files as data sources for training learning algorithms.

CSV files can be loaded into DataFrames with `pd.read_csv()`.

## Example using Google Stock data from 2004 to 2017

In [90]:
# Load data from csv
google_stock = pd.read_csv('./goog.csv')

# Check type and shape
print(type(google_stock))
print(google_stock.shape)

<class 'pandas.core.frame.DataFrame'>
(3313, 7)

In [91]:
# Display the DataFrame
google_stock

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

Pandas will automatically assigned numerically indexed row indices and labels from the csv file.

You can check the first few rows with `.head()` and last few rows with `.tail()`. Give these methods a number to get a specific number of rows (defaults to 5).

In [92]:
# First rows
google_stock.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [93]:
# Last rows
google_stock.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

Let's check for `NaN` values and get statistics on the data set

In [94]:
# Check for NaN values in each column (none found!)
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [95]:
# Get statistics on the data
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [96]:
# Get stats for a certain column only
google_stock['Adj Close'].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

### Statistical methods

Look at one statistic for each column using methods like `.max()`, `.min()`, and `.mean()`.

In [97]:
# Max for each column
google_stock.max()

Date         2017-10-13
Open                992
High             997.21
Low                 989
Close            989.68
Adj Close        989.68
Volume         82768100
dtype: object

In [98]:
# Min for each column
google_stock.min()

Date         2004-08-19
Open            49.2745
High            50.5413
Low               47.67
Close           49.6819
Adj Close       49.6819
Volume             7900
dtype: object

In [99]:
# Mean for each column
google_stock.mean()

Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

You can also check data correlation between columns with `.corr()`. A value of 1 means there's a high correlation and 0 means it is not correlated at all.

In [100]:
# Get correlation values for the stock data
google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

### `.groupby()` to see data in different ways

In [101]:
# Load some company data
data = pd.read_csv('./company_data.csv')

data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice      Admin   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   28   62000

In [102]:
# See how much money was spent on salaries every year
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [103]:
# See average salary for each year
data.groupby(['Year'])['Salary'].mean()

Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

In [104]:
# See the salary for each employee across the years
data.groupby(['Name'])['Salary'].sum()

Name
Alice      162000
Bob        150000
Charlie    177000
Name: Salary, dtype: int64

In [105]:
# See the salary distribution for each department per year
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64